**MAESTRÍA EN INTELIGENCIA ARTIFICIAL APLICADA**

**Curso: TC4029 - Ciencia y analítica de datos**

Tecnológico de Monterrey

Prof Grettel Barceló Alonso

**Semana 3**
Bases, almacenes y manipulación de datos

---

*   NOMBRE: Alexys Martín Coate Reyes
*   MATRÍCULA: A01746998

---

En esta actividad usarás la base de datos relacional `classicmodels` (MySQL), compuesta por las siguientes tablas:

*   `Customers`: almacena los datos de los clientes.
*   `Products`: almacena una lista de modelos de coches a escala.
*   `ProductLines`: almacena una lista de categorías de líneas de productos.
*   `Orders`: almacena los pedidos de venta realizados por los clientes.
*   `OrderDetails`: almacena elementos de línea de pedidos de ventas para cada pedido de ventas.
*   `Payments`: almacena los pagos realizados por los clientes en función de sus cuentas.
*   `Employees`: almacena toda la información de los empleados, así como la estructura de la organización, como quién informa a quién.
*   `Offices`: almacena los datos de la oficina de ventas.

Revisa con detalle su esquema para que comprendas cómo se relacionan las tablas anteriores.

Recuerda que:


*   Una **clave primaria** es un atributo (o conjunto) que identifica unívocamente a cada registro en la tabla.
*   Una **clave foránea** (externa o ajena) es un atributos (o conjunto) en una tabla que es una clave primaria en otra (o posiblemente la misma) tabla.
*   Las **relaciones** son las líneas que conectan una tabla con otra y el extremo determina la cardinalidad. Las relaciones con línea continua (identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser foránea y primaria (al mismo tiempo) de otra. Las relaciones con línea discontinua (no identificadora) representan una transformación donde la clave primaria de una tabla pasa a ser sólo foránea en otra.

# **Parte 1**. SQLAlchemy y SQL básico

In [25]:
pip install pymysql

Requirement already satisfied: pymysql in c:\users\amcr0\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (1.1.1)
Note: you may need to restart the kernel to use updated packages.

In [26]:
pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\amcr0\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (2.0.35)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\amcr0\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\amcr0\appdata\local\packages\pythonsoftwarefoundation.python.3.9_qbz5n2kfra8p0\localcache\local-packages\python39\site-packages (from sqlalchemy) (3.1.1)
Note: you may need to restart the kernel to use updated packages.

In [27]:
import sqlalchemy as sqla
import pymysql
import pandas as pd

1.	Crea el motor `sqlalchemy`, con el método `create_engine()` y una conexión con `connect()` como se muestra a continuación:

In [28]:
# Crear el motor (dialecto://usuarioBD:clave@ipHostDBMS:puerto/esquema
db = sqla.create_engine('mysql+pymysql://mnaTC4029User:mnaTC4029Pass!@20.106.217.214:3306/classicmodels', pool_recycle=3600)

# Crea una conexión para luego invocar declaraciones SQL
conn = db.connect()

Escribe las consultas en SQL para obtener:

2.	La información de las líneas de productos.

In [29]:
query = """
SELECT *
FROM productlines;
"""

pd.read_sql(query,conn)

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,None,None
1,Motorcycles,Our motorcycles are state of the art replicas ...,None,None
2,Planes,"Unique, diecast airplane and helicopter replic...",None,None
3,Ships,The perfect holiday or anniversary gift for ex...,None,None
4,Trains,Model trains are a rewarding hobby for enthusi...,None,None
5,Trucks and Buses,The Truck and Bus models are realistic replica...,None,None
6,Vintage Cars,Our Vintage Car models realistically portray a...,None,None

3.	La información de los empleados ordenados por nombre (`firstName`).

In [30]:
query = """
SELECT *
FROM employees
ORDER BY firstName;
"""
pd.read_sql(query,conn)

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
0,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
1,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
2,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
3,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
4,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
5,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143.0,Sales Rep
6,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
7,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep
8,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
9,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
10,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
11,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
12,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
13,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102.0,Sales Rep
14,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
15,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep
16,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
17,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
19,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
20,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
21,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
22,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep

4.	Los países donde hay oficinas (sin duplicar).

In [31]:
query = """
SELECT DISTINCT country
FROM offices
WHERE country IS NOT NULL;
"""

pd.read_sql(query,conn)

     country
0        USA
1     France
2      Japan
3  Australia
4         UK

5.	El nombre y teléfono de los clientes de la ciudad de Nueva York (*NYC*).

In [32]:
query = """
SELECT customerName, phone, city
FROM customers
WHERE city = 'NYC';
"""

pd.read_sql(query,conn)

           customerName       phone city
0     Land of Toys Inc.  2125557818  NYC
1    Muscle Machine Inc  2125557413  NYC
2       Vitachrome Inc.  2125551500  NYC
3  Classic Legends Inc.  2125558493  NYC
4       Microscale Inc.  2125551957  NYC

6.	El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [33]:
query = """
SELECT productCode, productName
FROM products
WHERE productVendor = 'Gearbox Collectibles' 
    AND quantityInStock < 1000;
"""

pd.read_sql(query,conn)

  productCode             productName
0    S18_2581          P-51-D Mustang
1    S18_2795  1928 Mercedes-Benz SSK

7.	Los tres productos más caros, desde el punto de visto de los comercializadores (`buyPrice`).

In [34]:
query = """
 SELECT productName, buyPrice
 FROM products
 ORDER BY buyPrice DESC
 LIMIT 3;
"""

pd.read_sql(query,conn)

                      productName  buyPrice
0          1962 LanciaA Delta 16V    103.42
1  1998 Chrysler Plymouth Prowler    101.51
2        1952 Alpine Renault 1300     98.58

8.	La cantidad de productos por línea de producto (no las existencias en inventario)

In [35]:
query = """
SELECT productLine, COUNT(DISTINCT productName) as count
FROM products
GROUP BY productLine
ORDER BY count DESC
"""

pd.read_sql(query,conn)

        productLine  count
0      Classic Cars     38
1      Vintage Cars     24
2       Motorcycles     13
3            Planes     12
4  Trucks and Buses     11
5             Ships      9
6            Trains      3

9.	La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [36]:
query = """
SELECT offices.country, offices.city, COUNT(offices.city)
FROM employees
INNER JOIN offices
ON employees.officeCode = offices.officeCode
GROUP BY offices.city, offices.country
ORDER BY offices.country, offices.city
"""

pd.read_sql(query,conn)

     country           city  COUNT(offices.city)
0  Australia         Sydney                    4
1     France          Paris                    5
2      Japan          Tokyo                    2
3         UK         London                    2
4        USA         Boston                    2
5        USA            NYC                    2
6        USA  San Francisco                    6

10.	El promedio de los pagos de cada uno de los clientes de España (sin incluir aquellos que no poseen ningún pago).

In [37]:
query = """
SELECT cu.customerName, avg(pay.amount)
FROM customers as cu
INNER JOIN payments as pay
ON cu.customerNumber = pay.customerNumber
WHERE cu.country = 'Spain'
GROUP BY cu.customerName
"""

pd.read_sql(query,conn)

                 customerName  avg(pay.amount)
0                 CAF Imports     23375.570000
1  Corrida Auto Replicas, Ltd     37480.030000
2          Enaco Distributors     22840.156667
3      Euro+ Shopping Channel     55056.844615
4  Iberia Gift Imports, Corp.     25493.925000

# **Parte 2**. Manipulación de datos con Pandas

11.	Carga las tablas empleadas en dataframes con el mismo nombre y resuelve las consultas anteriores con las funciones de Pandas (NO con SQL). Cuida no sobreescribir los dataframes originales al resolver las consultas. Debes obtener los mismos resultados que con SQL.

##### 1 Copiando las tablas de la base de datos en dataframes de pandas

In [38]:
query = """
SELECT * 
FROM """

tables = ["productlines", "products", "orderdetails", "orders", "customers", "employees", "offices", "payments"]

table_pd = {}

for table in tables:
    query += table
    print(query)
    globals()[table] = pd.read_sql(query,conn)
    query = query[:-len(table)]
    
for table in tables:
    globals()[table].head()

SELECT *
FROM productlines

SELECT *
FROM products

SELECT *
FROM orderdetails

SELECT *
FROM orders

SELECT *
FROM customers

SELECT *
FROM employees

SELECT *
FROM offices

SELECT *
FROM payments

2.	La información de las líneas de productos.

In [39]:
productlines

,productLine,textDescription,htmlDescription,image
0,Classic Cars,Attention car enthusiasts: Make your wildest c...,None,None
1,Motorcycles,Our motorcycles are state of the art replicas ...,None,None
2,Planes,"Unique, diecast airplane and helicopter replic...",None,None
3,Ships,The perfect holiday or anniversary gift for ex...,None,None
4,Trains,Model trains are a rewarding hobby for enthusi...,None,None
5,Trucks and Buses,The Truck and Bus models are realistic replica...,None,None
6,Vintage Cars,Our Vintage Car models realistically portray a...,None,None

3.	La información de los empleados ordenados por nombre (`firstName`).

In [40]:
employees.sort_values("firstName")

,employeeNumber,lastName,firstName,extension,email,officeCode,reportsTo,jobTitle
17,1611,Fixter,Andy,x101,afixter@classicmodelcars.com,6,1088.0,Sales Rep
5,1143,Bow,Anthony,x5428,abow@classicmodelcars.com,1,1056.0,Sales Manager (NA)
16,1504,Jones,Barry,x102,bjones@classicmodelcars.com,7,1102.0,Sales Rep
0,1002,Murphy,Diane,x5800,dmurphy@classicmodelcars.com,1,NaN,President
10,1286,Tseng,Foon Yue,x2248,ftseng@classicmodelcars.com,3,1143.0,Sales Rep
11,1323,Vanauf,George,x4102,gvanauf@classicmodelcars.com,3,1143.0,Sales Rep
13,1370,Hernandez,Gerard,x2028,ghernande@classicmodelcars.com,4,1102.0,Sales Rep
4,1102,Bondur,Gerard,x5408,gbondur@classicmodelcars.com,4,1056.0,Sale Manager (EMEA)
2,1076,Firrelli,Jeff,x9273,jfirrelli@classicmodelcars.com,1,1002.0,VP Marketing
8,1188,Firrelli,Julie,x2173,jfirrelli@classicmodelcars.com,2,1143.0,Sales Rep
15,1501,Bott,Larry,x2311,lbott@classicmodelcars.com,7,1102.0,Sales Rep
6,1165,Jennings,Leslie,x3291,ljennings@classicmodelcars.com,1,1143.0,Sales Rep
7,1166,Thompson,Leslie,x4065,lthompson@classicmodelcars.com,1,1143.0,Sales Rep
12,1337,Bondur,Loui,x6493,lbondur@classicmodelcars.com,4,1102.0,Sales Rep
20,1621,Nishi,Mami,x101,mnishi@classicmodelcars.com,5,1056.0,Sales Rep
22,1702,Gerard,Martin,x2312,mgerard@classicmodelcars.com,4,1102.0,Sales Rep
1,1056,Patterson,Mary,x4611,mpatterso@classicmodelcars.com,1,1002.0,VP Sales
14,1401,Castillo,Pamela,x2759,pcastillo@classicmodelcars.com,4,1102.0,Sales Rep
18,1612,Marsh,Peter,x102,pmarsh@classicmodelcars.com,6,1088.0,Sales Rep
9,1216,Patterson,Steve,x4334,spatterson@classicmodelcars.com,2,1143.0,Sales Rep
19,1619,King,Tom,x103,tking@classicmodelcars.com,6,1088.0,Sales Rep
3,1088,Patterson,William,x4871,wpatterson@classicmodelcars.com,6,1056.0,Sales Manager (APAC)
21,1625,Kato,Yoshimi,x102,ykato@classicmodelcars.com,5,1621.0,Sales Rep

4.	Los países donde hay oficinas (sin duplicar).

In [41]:
offices['country'].unique()

array(['USA', 'France', 'Japan', 'Australia', 'UK'], dtype=object)

5.	El nombre y teléfono de los clientes de la ciudad de Nueva York (*NYC*).

In [42]:
NYC_customers = customers[customers["city"] == "NYC"]
NYC_customers[["customerName","phone","city"]]

             customerName       phone city
9       Land of Toys Inc.  2125557818  NYC
15     Muscle Machine Inc  2125557413  NYC
27        Vitachrome Inc.  2125551500  NYC
98   Classic Legends Inc.  2125558493  NYC
105       Microscale Inc.  2125551957  NYC

6.	El código y nombre de los productos del vendedor *Gearbox Collectibles* que tengan menos de 1000 unidades en stock.

In [43]:
gearboxProducts_less1000 = products[(products['productVendor'] == 'Gearbox Collectibles') & (products['quantityInStock'] < 1000)]
gearboxProducts_less1000[["productCode","productName"]]

   productCode             productName
30    S18_2581          P-51-D Mustang
32    S18_2795  1928 Mercedes-Benz SSK

7.	Los tres productos más caros, desde el punto de visto de los comercializadores (`buyPrice`).

In [44]:
orderedProducts = products.sort_values("buyPrice",ascending=False)
orderedProducts[["productName","buyPrice"]].head(3)

                       productName  buyPrice
5           1962 LanciaA Delta 16V    103.42
25  1998 Chrysler Plymouth Prowler    101.51
1         1952 Alpine Renault 1300     98.58

8.	La cantidad de productos por línea de producto (no las existencias en inventario)

In [45]:
products["productLine"].value_counts()

productLine
Classic Cars        38
Vintage Cars        24
Motorcycles         13
Planes              12
Trucks and Buses    11
Ships                9
Trains               3
Name: count, dtype: int64

9.	La cantidad de empleados por país (tomando en cuenta la ubicación de la oficina).

In [52]:
employees_and_offices = pd.merge(employees,offices)
employees_and_offices.groupby(["country","city"]).size()

country    city
Australia  Sydney           4
France     Paris            5
Japan      Tokyo            2
UK         London           2
USA        Boston           2
           NYC              2
           San Francisco    6
dtype: int64

10.	El promedio de los pagos de cada uno de los clientes de España (sin incluir aquellos que no poseen ningún pago).

In [73]:
customers_and_payments = pd.merge(customers,payments)
pd.merge(customers,payments)
customers_and_payments.groupby(["country","customerName"])["amount"].mean()["Spain"]

customerName
CAF Imports                   23375.570000
Corrida Auto Replicas, Ltd    37480.030000
Enaco Distributors            22840.156667
Euro+ Shopping Channel        55056.844615
Iberia Gift Imports, Corp.    25493.925000
Name: amount, dtype: float64

# **Parte 3**. Cliente de Python Firestore

En esta fase te conectarás a una base de datos no relacional de Firestore desde Python. Para ello utilizarás los módulos `credentials` y `firestore` de la biblioteca `firebase_admin`.

In [76]:
import firebase_admin
from firebase_admin import credentials
from firebase_admin import firestore

El archivo `veterinary.json` almacena la clave privada para autenticar una cuenta y autorizar el acceso a los servicios de Firebase. A través de la función `Certificate()`, se regresa una credencial inicializada, que puedes utilizar para crear una nueva instancia de la aplicación. Después de eso, tu conexión a Firestore utilizará las reglas de seguridad establecidas para la base de datos y el usuario autenticado.

In [77]:
from google.colab import drive
drive.mount('/content/drive')

ModuleNotFoundError: No module named 'google.colab'

In [ ]:
import os
DIR = "/content/drive/MyDrive/Colab Notebooks/MNA/TC4029 - Ciencia y analítica de datos/Semana 3/Actividad3_BD_Manipulacion"
os.chdir(DIR)

In [ ]:
cred = credentials.Certificate('veterinary.json')
firebase_admin.initialize_app(cred)
db = firestore.client()

12.	Investiga cómo leer la colección `PET_OWNER` y mostrar su contenido en un dataframe. Asegúrate de incluir el id en el resultado

In [ ]:
firebase_admin.delete_app(firebase_admin.get_app())